Hi, I found the solution to this problem! Here is the explanation: this is not a terraform behavior; it's all about AWS! When terraform applies again, the AWS is always accepts the key in EOT format. Here is my output below:

```
  # module.cloudfront.aws_cloudfront_public_key.this[0] must be replaced
-/+ resource "aws_cloudfront_public_key" "this" {
      ~ caller_reference = "terraform-20240118203726052400000001" -> (known after apply)
      ~ comment          = "CloudFront public key" -> "CloudFront public key by Terraform"
      ~ encoded_key      = <<-EOT # forces replacement
            -----BEGIN PUBLIC KEY-----
          - MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzV0iKGfIAgh3TYCphzs8
          - o8hltBehpqszB6FVBP46+ShAdYyk99zXb0hMwj+P9gGRUjghvXMXhaj8kDm7eYe2
          - gnUqDUSpCMItE5Y7Qi5VM9jG2F4W0SVDw4XqPR4PoEN2jzyubntK2ZLzCQpZhGFd
          - 8ZbuG2KHEuKkpIuvRg01Ulw51/ox286l4aLqyGBozPgu24urriJhxVaCgv8eNSAA
          - Bily+AUU6U8BaP0rq2AThNLwahKcJKkPrGDyBof4uWGKKp2tzXPuAYtku+nf4Xjk
          - DXrdnS/zYvaihQzbeWm2/5jLGfezBe4Dx/6uQ7hoP0UdlHXOHZ790/rY3sqGtUYZ
          - owIDAQAB
          + MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzV0iKGfIAgh3TYCphzs8o8hltBehpqszB6FVBP46+ShAdYyk99zXb0hMwj+P9gGRUjghvXMXhaj8kDm7eYe2gnUqDUSpCMItE5Y7Qi5VM9jG2F4W0SVDw4XqPR4PoEN2jzyubntK2ZLzCQpZhGFd8ZbuG2KHEuKkpIuvRg01Ulw51/ox286l4aLqyGBozPgu24urriJhxVaCgv8eNSAABily+AUU6U8BaP0rq2AThNLwahKcJKkPrGDyBof4uWGKKp2tzXPuAYtku+nf4XjkDXrdnS/zYvaihQzbeWm2/5jLGfezBe4Dx/6uQ7hoP0UdlHXOHZ790/rY3sqGtUYZowIDAQAB
            -----END PUBLIC KEY-----
        EOT
      ~ etag             = "E1BQZRBB4L9FUS" -> (known after apply)
      ~ id               = "K3CNOYX08R3CXZ" -> (known after apply)
        name             = "Test-public-key-0"
      + name_prefix      = (known after apply)
    }
```

# What I did?

First of all, I used:

```
variable "backend_cf_public_key" {
  type = string
  default = "-----BEGIN PUBLIC KEY-----\nMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzV0iKGfIAgh3TYCphzs8o8hltBehpqszB6FVBP46+ShAdYyk99zXb0hMwj+P9gGRUjghvXMXhaj8kDm7eYe2gnUqDUSpCMItE5Y7Qi5VM9jG2F4W0SVDw4XqPR4PoEN2jzyubntK2ZLzCQpZhGFd8ZbuG2KHEuKkpIuvRg01Ulw51/ox286l4aLqyGBozPgu24urriJhxVaCgv8eNSAABily+AUU6U8BaP0rq2AThNLwahKcJKkPrGDyBof4uWGKKp2tzXPuAYtku+nf4XjkDXrdnS/zYvaihQzbeWm2/5jLGfezBe4Dx/6uQ7hoP0UdlHXOHZ790/rY3sqGtUYZowIDAQAB\n-----END PUBLIC KEY-----"
}
```

I just replaced my single line key to *multi-line strings* and it worked!

```
variable "backend_cf_public_key" {
  type    = string
  default = <<-EOT
    -----BEGIN PUBLIC KEY-----
    MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzV0iKGfIAgh3TYCphzs8
    o8hltBehpqszB6FVBP46+ShAdYyk99zXb0hMwj+P9gGRUjghvXMXhaj8kDm7eYe2
    gnUqDUSpCMItE5Y7Qi5VM9jG2F4W0SVDw4XqPR4PoEN2jzyubntK2ZLzCQpZhGFd
    8ZbuG2KHEuKkpIuvRg01Ulw51/ox286l4aLqyGBozPgu24urriJhxVaCgv8eNSAA
    Bily+AUU6U8BaP0rq2AThNLwahKcJKkPrGDyBof4uWGKKp2tzXPuAYtku+nf4Xjk
    DXrdnS/zYvaihQzbeWm2/5jLGfezBe4Dx/6uQ7hoP0UdlHXOHZ790/rY3sqGtUYZ
    owIDAQAB
    -----END PUBLIC KEY-----
  EOT
}
```

Also, you can use with the "line break" below:

```
variable "backend_cf_public_key" {
  type    = string
  default = "-----BEGIN PUBLIC KEY-----\nMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzV0iKGfIAgh3TYCphzs8\no8hltBehpqszB6FVBP46+ShAdYyk99zXb0hMwj+P9gGRUjghvXMXhaj8kDm7eYe2\ngnUqDUSpCMItE5Y7Qi5VM9jG2F4W0SVDw4XqPR4PoEN2jzyubntK2ZLzCQpZhGFd\n8ZbuG2KHEuKkpIuvRg01Ulw51/ox286l4aLqyGBozPgu24urriJhxVaCgv8eNSAA\nBily+AUU6U8BaP0rq2AThNLwahKcJKkPrGDyBof4uWGKKp2tzXPuAYtku+nf4Xjk\nDXrdnS/zYvaihQzbeWm2/5jLGfezBe4Dx/6uQ7hoP0UdlHXOHZ790/rY3sqGtUYZ\nowIDAQAB\n-----END PUBLIC KEY-----\n"
}
```

Voila! 🥳 